kadamski/chopstx/mcu/usb-gd32vf103.c
/*
 * usb-gd32vf103.c - USB driver for GD32VF103
 *
 * Copyright (C) 2019  Flying Stone Technology
 * Author: NIIBE Yutaka <gniibe@fsij.org>
 *
 * This file is a part of Chopstx, a thread library for embedded.
 *
 * Chopstx is free software: you can redistribute it and/or modify it
 * under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * Chopstx is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 *
 * As additional permission under GNU GPL version 3 section 7, you may
 * distribute non-source form of the Program without the copy of the
 * GNU GPL normally required by section 4, provided you inform the
 * recipients of GNU GPL by a written offer.
 *
 */

#include <stdint.h>
#include <stdlib.h>
#include <string.h>

#include <chopstx.h>
#include <mcu/gd32vf103.h>

#define MCU_GD32VF1
#include "usb_lld.h"

/*
 * This driver is for USB device functionality (not host).
 *
 * This driver doesn't support isochronous transfer (yet).
 * Only supports one packet at a time.
 */

#ifdef DEBUG_BY_SERIAL_OUTPUT
extern void debug (const char *fmt, ...);
#else
#define debug(a,...) /**/
#endif

#define USB_DIR_OUT  0
#define USB_DIR_IN   1
#define USB_DIR_BOTH 2

#define USBFS_BASE 0x50000000

/* USB Global registers */
struct USB_G {
  volatile uint32_t GOTGCS;
  volatile uint32_t GOTGINTF;
  volatile uint32_t GAHBCS;
  volatile uint32_t GUSBCS;

  volatile uint32_t GRSTCTL;
  volatile uint32_t GINTF;
  volatile uint32_t GINTEN;
  volatile uint32_t GRSTATR;

  volatile uint32_t GRSTATP;
  volatile uint32_t GRFLEN;
  volatile uint32_t DIEP0TFLEN_HNPTFLEN;
  volatile uint32_t HNPTFQSTAT;

  uint32_t rsvd0;
  uint32_t rsvd1;
  volatile uint32_t GCCFG;
  volatile uint32_t CID;
  uint32_t rsvd2[48];
  uint32_t rsvd3;
  volatile uint32_t DIEP_TFLEN[3];
};
static struct USB_G *const USB_G = (struct USB_G *)USBFS_BASE;

/* USB Device registers */
struct USB_D {
  volatile uint32_t DCFG;
  volatile uint32_t DCTL;
  volatile uint32_t DSTAT;
  uint32_t rsvd0;

  volatile uint32_t DIEPINTEN;
  volatile uint32_t DOEPINTEN;
  volatile uint32_t DAEPINT;
  volatile uint32_t DAEPINTEN;

  uint32_t rsvd1;
  uint32_t rsvd2;
  volatile uint32_t DVBUSDT;
  volatile uint32_t DVPUSPT;

  uint32_t rsvd3;
  volatile uint32_t DIEPFEINTEN;
};
static struct USB_D *const USB_D = (struct USB_D *)(USBFS_BASE+0x800);

/* USB device endpoint IN registers */
struct USB_I {
  volatile uint32_t DIEP_CTL;
  uint32_t rsvd0;
  volatile uint32_t DIEP_INTF;
  uint32_t rsvd1;

  volatile uint32_t DIEP_LEN;
  uint32_t rsvd2;
  volatile uint32_t DIEP_TFSTAT;
  uint32_t rsvd3;
};
static struct USB_I *const USB_I = (struct USB_I *)(USBFS_BASE+0x900);

/* USB device endpoint OUT registers */
struct USB_O {
  volatile uint32_t DOEP_CTL;
  uint32_t rsvd0;
  volatile uint32_t DOEP_INTF;
  uint32_t rsvd1;

  volatile uint32_t DOEP_LEN;
  uint32_t rsvd2;
  uint32_t rsvd3;
  uint32_t rsvd4;
};
static struct USB_O *const USB_O = (struct USB_O *)(USBFS_BASE+0xB00);

#if 0
/* USB Power control register */
struct USB_P {
  volatile uint32_t PWRCLKCTL;
};
static struct USB_P *const USB_P = (struct USB_P *)(USBFS_BASE+0xE00);
#endif

struct USB_FIFO {
  struct {
    volatile uint32_t data;
    uint32_t rsvd[1023];
  } FIFO[4];
};
static struct USB_FIFO *const USB_FIFO = (struct USB_FIFO *)(USBFS_BASE+0x1000);

#define USB_ENDPOINT_MAX 4

static void
gd32vf_usb_clock_init (void)
{
  /* Reset the clock.  */
  if ((RCU->AHBEN & RCU_AHB_USBFS)
      && (RCU->AHBRST & RCU_AHB_USBFS) == 0)
    /* Make sure the device is disconnected, even after core reset.  */
    {
      RCU->AHBEN &= ~RCU_AHB_USBFS;
      RCU->AHBRST = RCU_AHB_USBFS;

      /* Disconnect requires SE0 (>= 2.5uS).  */
      chopstx_usec_wait (10);
    }

  if ((RCU->AHBEN & RCU_AHB_USBFS) == 0)
    {
      RCU->AHBEN |= RCU_AHB_USBFS;
      RCU->AHBRST = RCU_AHB_USBFS;
      RCU->AHBRST = 0;
    }
}

static void
gd32vf_usb_init (void)
{
  uint32_t usb_ramaddr = 0;
  int i;

  gd32vf_usb_clock_init ();

  /* Undocumented setting of PHY (GD specific).  */
  USB_G->GUSBCS |= (1 << 6);    /* Use embedded PHY */

  /* Enable the transceiver.  */
  USB_G->GCCFG = (1 << 19) | (1 << 18) | (1 << 16);
  /* Disable monitoring VBUS pin (GD specific).  */
  USB_G->GCCFG |= (1 << 21);

  chopstx_usec_wait (20*1000);

  /* Disconnect.  */
  USB_D->DCTL |= (1 << 1);

  /* Select device mode (not host mode or OTG).  */
  USB_G->GUSBCS &= ~((1 << 30) | (1 << 29));
  USB_G->GUSBCS |= (1 << 30);

  chopstx_usec_wait (10*1000);

  /* Configure the receive FIFO RAM address */
  USB_G->GRFLEN = 64;
  usb_ramaddr += 64;

  USB_G->DIEP0TFLEN_HNPTFLEN = (64 << 16) | usb_ramaddr;
  usb_ramaddr += 64;

  for (i = 1; i < USB_ENDPOINT_MAX; i++)
    {
      USB_G->DIEP_TFLEN[i - 1] = (64 << 16) | usb_ramaddr;
      usb_ramaddr += 64;
    }

  /* Configure device mode.  */
  USB_D->DCFG &= ~((1 << 12) | (1 << 11)); /* 80% of frame interval */
  USB_D->DCFG |= ((1 << 1)| (1 << 0));     /* Full speed */

  /* Connect */
  USB_D->DCTL &= ~(1 << 1);

  /* Interrupt setup.  */

  /* Transfer finished.  */
  USB_D->DIEPINTEN |= (1 << 0);
  /* Setup finished, Transfer finished.  */
  USB_D->DOEPINTEN |= (1 << 3) | (1 << 0);
  /* Configure for endpoint 0, IN and OUT.  */
  USB_D->DAEPINTEN = (1 << 16) | (1 << 0);

  /* Wakeup and Suspend.  */
  USB_G->GINTEN |= (1 << 31) | (1 << 11);
  /* IN and OUT.  */
  USB_G->GINTEN |= (1 << 19) | (1 << 18);
  /* USB Reset.  */
  USB_G->GINTEN |= (1 << 12);
  /* Speed enumeration.  */
  USB_G->GINTEN |= (1 << 13);

  /* RxFIFO non-empty */
  USB_G->GINTEN |= (1 << 4);

  /* Note: We don't enable event for start of frame (1 << 3) */

  /* TxFIFO completely empty, Enable interrupt from the USB module.  */
  USB_G->GAHBCS |= (1 << 7) | (1 << 0);
}

static void
gd32vf_set_daddr (uint8_t daddr)
{
  USB_D->DCFG = (USB_D->DCFG & ~(0x7f << 4)) | (daddr << 4);
}

static void
gd32vf_prepare_ep0_setup_init (void)
{
  /* Max packet length: 64-byte.  */
  USB_I[0].DIEP_CTL &= ~0x03;

  /* Clear global OUT NAK, IN NAK.  */
  USB_D->DCTL |= (1 << 10) | (1 << 8);
}

static void
gd32vf_prepare_ep0_setup (struct usb_dev *dev)
{
  dev->ctrl_data.addr = (uint8_t *)&dev->dev_req;
  dev->ctrl_data.len = 8;
  dev->ctrl_data.require_zlp = 0;

  /* Configure control endpoint to accept 8-byte SETUP stage.  */
  /*
   * Note: It makes no sense to configure back-to-back setup.
   * In a correct control transfer, a setup stage is always
   * followed by data stage or status stage.
   */
  /* setup_cnt=1, packet_cnt=1, buflen=8-byte.  */
  USB_O[0].DOEP_LEN = (1 << 29) | (1 << 19) | 8;
  USB_O[0].DOEP_CTL |= (1 << 31) | (1 << 26); /* Enable and Clear NAK */
}

static void
gd32vf_tx_fifo_flush (int n)
{
  USB_G->GRSTCTL = (n << 6) | (1 << 5);
  while ((USB_G->GRSTCTL & (1 << 5)))
    chopstx_usec_wait (100);
  chopstx_usec_wait (100);
}

static void
gd32vf_tx_fifo_write (int n, const void *buf, uint8_t len)
{
  const uint8_t *p = buf;
  uint32_t data;
  int i;

