kadamski/chopstx/mcu/usb-gd32vf103.c
#if 0
  if ((USB_I[n].DIEP_TFSTAT & 0xffff) < len)
    {                           /* Not enough space, yet */
      return;
    }
#endif

  for (i = 0; i < len / 4; i++)
    {
      data = p[0] | (p[1] << 8) | (p[2] << 16) | (p[3] << 24);
      p += 4;
      USB_FIFO->FIFO[n].data = data;
    }

  if ((len % 4))
    {
      data = 0;
      for (i = 0; i < (len % 4); i++)
	data |= (*p++) << (i * 8);
      USB_FIFO->FIFO[n].data = data;
    }
}

static void
gd32vf_prepare_ep0_in (uint8_t len)
{
  USB_I[0].DIEP_LEN = (1 << 19) | len; /* 1-packet, len-byte */
  if (len)
    USB_D->DIEPFEINTEN |= (1 << 0);
  USB_I[0].DIEP_CTL |= (1 << 31) | (1 << 26); /* Enable and Clear NAK */
}

/* Note: No support of multiple DATA transfer.  It's by DATA1 only.  */
static void
gd32vf_prepare_ep0_out (uint8_t len)
{
  /* Set pktcnt=1 and length, while keeping SETUP_COUNT field.  */
  USB_O[0].DOEP_LEN &= ~127;                 /* Clear length field.  */
  USB_O[0].DOEP_LEN |= (1 << 19) | len;
  USB_O[0].DOEP_CTL = (1 << 31) | (1 << 26); /* Enable and Clear NAK */
}

static int
gd32vf_ep_is_active (uint8_t n, int dir)
{
  uint32_t bit_to_examine;

  if (dir == USB_DIR_IN)
    bit_to_examine = (USB_I[n].DIEP_CTL & (1 << 15));
  else
    bit_to_examine = (USB_O[n].DOEP_CTL & (1 << 15));

  return bit_to_examine != 0;
}

static int
gd32vf_ep_is_stalled (uint8_t n, int dir)
{
  uint32_t bit_to_examine;

  if (dir == USB_DIR_IN)
    bit_to_examine = (USB_I[n].DIEP_CTL & (1 << 21));
  else
    bit_to_examine = (USB_O[n].DOEP_CTL & (1 << 21));

  return bit_to_examine != 0;
}

static void
gd32vf_ep_stall (uint8_t n, int dir)
{
  if (dir == USB_DIR_IN || dir == USB_DIR_BOTH)
    {
      /* When it's active, disable it.  */
      if (USB_I[n].DIEP_CTL & (1 << 31))
	USB_I[n].DIEP_CTL |= (1 << 30);

      USB_I[n].DIEP_CTL |= (1 << 21);
    }

  if (dir == USB_DIR_OUT || dir == USB_DIR_BOTH)
    USB_O[n].DOEP_CTL |= (1 << 21);
}

static void
gd32vf_ep_clear_stall (uint8_t n, int dir)
{
  if (dir == USB_DIR_IN || dir == USB_DIR_BOTH)
    {
      USB_I[n].DIEP_CTL &= ~(1 << 21);
      USB_I[n].DIEP_CTL |= (1 << 28);
    }

  if (dir == USB_DIR_OUT || dir == USB_DIR_BOTH)
    {
      USB_O[n].DOEP_CTL &= ~(1 << 21);
      USB_O[n].DOEP_CTL |= (1 << 28);
    }
}

#include "usb_lld_driver.h"

static int handle_in0 (struct usb_dev *dev);
static void handle_out0 (struct usb_dev *dev);
static int handle_setup0 (struct usb_dev *dev);


void
usb_lld_stall_tx (struct usb_dev *dev, int n)
{
  (void)dev;
  gd32vf_ep_stall (n, USB_DIR_IN);
}

void
usb_lld_stall_rx (struct usb_dev *dev, int n)
{
  (void)dev;
  gd32vf_ep_stall (n, USB_DIR_OUT);
}


void
usb_lld_ctrl_error (struct usb_dev *dev)
{
  dev->state = STALLED;
  gd32vf_ep_stall (ENDP0, USB_DIR_BOTH);
}

int
usb_lld_ctrl_ack (struct usb_dev *dev)
{
  debug ("C W ack");
  /* Zero length packet for ACK.  */
  dev->state = WAIT_STATUS_IN;
  gd32vf_prepare_ep0_in (0);
  return USB_EVENT_OK;
}


void
usb_lld_init (struct usb_dev *dev, uint8_t feature)
{
  usb_lld_set_configuration (dev, 0);
  dev->feature = feature;
  dev->state = WAIT_SETUP;
  gd32vf_usb_init ();
}


static void
read_from_rx_fifo (struct usb_dev *dev)
{
  /* RxFIFO ready.  */
  uint32_t stat = USB_G->GRSTATP;
  uint8_t ep_num = (stat & 0x0f);
  uint16_t len = (stat >> 4) & 0x7ff;
  uint8_t pkt = (stat >> 17) & 0x0f;

  if (ep_num == 0)
    {
      uint8_t *p = dev->ctrl_data.addr;
      uint32_t data;
      int i;

      if (pkt == 0x06)
	{
	  debug ("\rrx S %d", len);
	  if (dev->ctrl_data.len == 0)
	    {
	      /* Receiving re-send of SETUP packet.  */
	      p = dev->ctrl_data.addr - 8;
	    }
	}
      else if (pkt == 0x02)
	{
	  if (len > dev->ctrl_data.len)
	    {
	      len = dev->ctrl_data.len;
	      debug ("rx O %d*", len);
	    }
	  else
	    {
	      debug ("rx O %d", len);
	    }
	}
      else
	return;

      for (i = 0; i < len / 4; i++)
	{
#ifdef DEBUG_BY_SERIAL_OUTPUT
	  uint8_t *p0 = p;
#endif
	  data = USB_FIFO->FIFO[0].data;
	  *p++ = (data & 0xff);
	  data >>= 8;
	  *p++ = (data & 0xff);
	  data >>= 8;
	  *p++ = (data & 0xff);
	  data >>= 8;
	  *p++ = (data & 0xff);
	  debug ("%02x %02x %02x %02x", p0[0], p0[1], p0[2], p0[3]);
	}

      if ((len % 4))
	{
	  data = USB_FIFO->FIFO[0].data;
	  for (i = 0; i < (len % 4); i++)
	    {
	      *p++ = (data & 0xff);
	      debug ("%02x", (data & 0xff));
	      data >>= 8;
	    }
	}

      dev->ctrl_data.len -= len;
      dev->ctrl_data.addr += len;
    }
  else 
    {
      uint8_t *p = dev->epctl_rx[ep_num-1].addr;
      uint32_t data;
      int i;

      if (pkt == 0x02)
	{
	  if (len > dev->epctl_rx[ep_num-1].len)
	    {
	      len = dev->epctl_rx[ep_num-1].len;
	      debug ("\rrx EP%d O %d*", ep_num, len);
	    }
	  else
	    {
	      debug ("\rrx EP%d O %d", ep_num, len);
	    }

	  dev->epctl_rx[ep_num-1].len = len;
	}
      else
	return;

      for (i = 0; i < len / 4; i++)
	{
#ifdef DEBUG_BY_SERIAL_OUTPUT
	  uint8_t *p0 = p;
#endif
	  data = USB_FIFO->FIFO[ep_num].data;
	  *p++ = (data & 0xff);
	  data >>= 8;
	  *p++ = (data & 0xff);
	  data >>= 8;
	  *p++ = (data & 0xff);
	  data >>= 8;
	  *p++ = (data & 0xff);
	  debug ("%02x %02x %02x %02x", p0[0], p0[1], p0[2], p0[3]);
	}

      if ((len % 4))
	{
	  data = USB_FIFO->FIFO[ep_num].data;
	  for (i = 0; i < (len % 4); i++)
	    {
	      *p++ = (data & 0xff);
	      debug ("%02x", (data & 0xff));
	      data >>= 8;
	    }
	}
    }
}

#define USB_MAKE_EV(event) (event<<24)
#define USB_MAKE_TXRX(ep_num,txrx,len) ((txrx? (1<<23):0)|(ep_num<<16)|len)

int
usb_lld_event_handler (struct usb_dev *dev)
{
  uint32_t gintr = (USB_G->GINTF & USB_G->GINTEN);
  uint32_t bits;
  uint32_t ep_num = 0;
  static uint32_t sof = 0;

  if (!gintr)
    return USB_EVENT_OK;
  else if ((gintr & (1 << 3)))
    {
      /* sof */
      if ((sof++ & 0xff) == 0xff)
	{
	  debug ("sof");
	}
      USB_G->GINTF = (1 << 3);
      return USB_EVENT_OK;
    }
  else if ((gintr & (1 << 31)))
    {
      /* wakeup */
      debug ("\rwakeup");
      USB_G->GINTF = (1 << 31);
      return USB_MAKE_EV (USB_EVENT_DEVICE_WAKEUP);
    }
  else if ((gintr & (1 << 11)))
    {
      debug ("\rsuspend");
      /* suspend */
      USB_G->GINTF = (1 << 11);
      return USB_MAKE_EV (USB_EVENT_DEVICE_SUSPEND);
    }
  else if ((gintr & (1 << 19)))
    {
      /* SETUP or OUT */
      for (bits = ((USB_D->DAEPINT >> 16) & 0x0f); bits; bits >>= 1, ep_num++)
	if ((bits & 1))
	  {
#if 0
	    if ((USB_O[ep_num].DOEP_INTF & (1 << 6)))
	      {
		/* Multiple SETUP packets received.  */
		USB_O[ep_num].DOEP_INTF |= (1 << 6);
	      }
#endif

	    if (ep_num == 0 && (USB_O[ep_num].DOEP_INTF & (1 << 3)))
	      {
		int r = USB_MAKE_EV (handle_setup0 (dev));
		USB_O[ep_num].DOEP_INTF |= (1 << 3);
		return r;
	      }
	    else if ((USB_O[ep_num].DOEP_INTF & (1 << 0)))
	      {
		USB_O[ep_num].DOEP_INTF |= (1 << 0);
		debug ("O %d", ep_num);
		if (ep_num == 0)
		  {
		    /* Ignore transfer finished for OUT which comes at SETUP */
		    if (dev->state != WAIT_SETUP)
		      handle_out0 (dev);
		    return USB_EVENT_OK;
		  }
		else
		  return USB_MAKE_TXRX (ep_num, 0, dev->epctl_rx[ep_num-1].len);
	      }
	  }
    }
  else if ((gintr & (1 << 18)))
    {
      /* IN */
      for (bits = (USB_D->DAEPINT & 0x0f); bits; bits >>= 1, ep_num++)
	if ((bits & 1))
	  {
#if 0
	    if ((USB_I[ep_num].DIEP_INTF & (1 << 3)))
	      {
		USB_I[ep_num].DIEP_INTF = (1 << 3);
	      }
#endif

