kadamski/chopstx/mcu/usb-gd32vf103.c
	    if ((USB_I[ep_num].DIEP_INTF & (1 << 0)))
	      {
		USB_I[ep_num].DIEP_INTF = (1 << 0);
		debug ("I %d", ep_num);
		if (ep_num == 0)
		  return USB_MAKE_EV (handle_in0 (dev));
		else
		  return USB_MAKE_TXRX (ep_num, 1, dev->epctl_tx[ep_num-1].len);
	      }

	    if ((USB_I[ep_num].DIEP_INTF & (1 << 7)))
	      {
		uint8_t len;

		len = USB_I[ep_num].DIEP_LEN & 0x7f;
		debug ("fifo tx %d (%d)", ep_num, len);
		if (ep_num)
		  {
		    gd32vf_tx_fifo_write (ep_num, dev->epctl_tx[ep_num-1].addr,
					  len);
		    USB_D->DIEPFEINTEN &= ~(1 << ep_num);
		  }
		else
		  {
		    gd32vf_tx_fifo_write (0, dev->ctrl_data.addr, len);

		    dev->ctrl_data.len -= len;
		    dev->ctrl_data.addr += len;
		    if (dev->ctrl_data.len == 0)
		      {
			USB_D->DIEPFEINTEN &= ~(1 << ep_num);
			debug ("< %d: done", len);
		      }
		    else
		      {
			debug ("< %d", len);
		      }
		  }

		USB_I[ep_num].DIEP_INTF = (1 << 7);
	      }
	  }
    }
  else if ((gintr & (1 << 4)))
    {
      read_from_rx_fifo (dev);
    }
  else if ((gintr & (1 << 13)))
    {
      /* Speed enumeration: HS/FS negotiation.  */
      /*
       * Set the UTT (USB turnaround time).
       * Value is not documented for GD.
       * Need change for STM32.
       */
      USB_G->GUSBCS |= 0x05 << 10;
      USB_G->GINTF = (1 << 13);
      debug ("spd=FS");
    }
  else if ((gintr & (1 << 12)))
    {
      /* USB RESET */
      USB_G->GINTF = (1 << 12);
      return USB_MAKE_EV (USB_EVENT_DEVICE_RESET);
    }

  return USB_EVENT_OK;
}


static void
handle_datastage_out (struct usb_dev *dev)
{
  if (dev->ctrl_data.len == 0)
    {
      debug ("C W ack!");
      dev->state = WAIT_STATUS_IN;
      gd32vf_prepare_ep0_in (0);
    }
  else
    {
      uint8_t len = dev->ctrl_data.len;
      if (len > USB_MAX_PACKET_SIZE)
	len = USB_MAX_PACKET_SIZE;

      dev->state = OUT_DATA;
      gd32vf_prepare_ep0_out (len);
    }
}


static void
handle_datastage_in (struct usb_dev *dev)
{
  uint32_t len = USB_MAX_PACKET_SIZE;
  struct ctrl_data *data_p = &dev->ctrl_data;

  if ((data_p->len == 0) && (dev->state == LAST_IN_DATA))
    {
      if (data_p->require_zlp)
	{
	  data_p->require_zlp = 0;

	  /* No more data to send.  Send empty packet */
	  gd32vf_prepare_ep0_in (0);
	}
      else
	{
	  /* No more data to send, proceed to receive OUT acknowledge.  */
	  dev->state = WAIT_STATUS_OUT;
	  gd32vf_prepare_ep0_out (0);
	}

      return;
    }

  dev->state = (data_p->len <= len) ? LAST_IN_DATA : IN_DATA;

  if (len > data_p->len)
    len = data_p->len;

  gd32vf_prepare_ep0_in (len);
}

typedef int (*HANDLER) (struct usb_dev *dev);

static int
std_none (struct usb_dev *dev)
{
  (void)dev;
  return -1;
}

static uint16_t status_info;

static int
direction_of_endpoint (struct device_req *arg)
{
  return (arg->index & 0x80)? USB_DIR_IN : USB_DIR_OUT;
}

static int
std_get_status (struct usb_dev *dev)
{
  struct device_req *arg = &dev->dev_req;
  uint8_t rcp = arg->type & RECIPIENT;

  if (arg->value != 0 || arg->len != 2 || (arg->index >> 8) != 0
      || USB_SETUP_SET (arg->type))
    return -1;

  if (rcp == DEVICE_RECIPIENT)
    {
      if (arg->index == 0)
	{
	  /* Get Device Status */
	  uint8_t feature = dev->feature;

	  /* Remote Wakeup enabled */
	  if ((feature & (1 << 5)))
	    status_info |= 2;
	  else
	    status_info &= ~2;

	  /* Bus-powered */
	  if ((feature & (1 << 6)))
	    status_info |= 1;
	  else /* Self-powered */
	    status_info &= ~1;

	  return usb_lld_ctrl_send (dev, &status_info, 2);
	}
    }
  else if (rcp == INTERFACE_RECIPIENT)
    {
      if (dev->configuration == 0)
	return -1;

      return USB_EVENT_GET_STATUS_INTERFACE;
    }
  else if (rcp == ENDPOINT_RECIPIENT)
    {
      uint8_t n = (arg->index & 0x0f);

      if ((arg->index & 0x70) || n == ENDP0)
	return -1;

      if (!gd32vf_ep_is_active (n, direction_of_endpoint (arg)))
	return -1;

      status_info = gd32vf_ep_is_stalled (n, direction_of_endpoint (arg));

      return usb_lld_ctrl_send (dev, &status_info, 2);
    }

  return -1;
}

static int
std_clear_feature (struct usb_dev *dev)
{
  struct device_req *arg = &dev->dev_req;
  uint8_t rcp = arg->type & RECIPIENT;

  if (USB_SETUP_GET (arg->type))
    return -1;

  if (rcp == DEVICE_RECIPIENT)
    {
      if (arg->len != 0 || arg->index != 0)
	return -1;

      if (arg->value == FEATURE_DEVICE_REMOTE_WAKEUP)
	{
	  dev->feature &= ~(1 << 5);
	  return USB_EVENT_CLEAR_FEATURE_DEVICE;
	}
    }
  else if (rcp == ENDPOINT_RECIPIENT)
    {
      uint8_t n = (arg->index & 0x0f);

      if (dev->configuration == 0)
	return -1;

      if (arg->len != 0 || (arg->index >> 8) != 0
	  || arg->value != FEATURE_ENDPOINT_HALT || n == ENDP0)
	return -1;

      if (!gd32vf_ep_is_active (n, direction_of_endpoint (arg)))
	return -1;

      gd32vf_ep_clear_stall (n, direction_of_endpoint (arg));

      return USB_EVENT_CLEAR_FEATURE_ENDPOINT;
    }

  return -1;
}

static int
std_set_feature (struct usb_dev *dev)
{
  struct device_req *arg = &dev->dev_req;
  uint8_t rcp = arg->type & RECIPIENT;

  if (USB_SETUP_GET (arg->type))
    return -1;

  if (rcp == DEVICE_RECIPIENT)
    {
      if (arg->len != 0 || arg->index != 0)
	return -1;

      if (arg->value == FEATURE_DEVICE_REMOTE_WAKEUP)
	{
	  dev->feature |= 1 << 5;
	  return USB_EVENT_SET_FEATURE_DEVICE;
	}
    }
  else if (rcp == ENDPOINT_RECIPIENT)
    {
      uint8_t n = (arg->index & 0x0f);

      if (dev->configuration == 0)
	return -1;

      if (arg->len != 0 || (arg->index >> 8) != 0
	  || arg->value != FEATURE_ENDPOINT_HALT || n == ENDP0)
	return -1;

      if (!gd32vf_ep_is_active (n, direction_of_endpoint (arg)))
	return -1;

      if ((arg->index & 0x80))	/* IN endpoint */
	gd32vf_ep_stall (n, USB_DIR_IN);
      else
	gd32vf_ep_stall (n, USB_DIR_OUT);

      return USB_EVENT_SET_FEATURE_ENDPOINT;
    }

  return -1;
}

static int
std_set_address (struct usb_dev *dev)
{
  struct device_req *arg = &dev->dev_req;
  uint8_t rcp = arg->type & RECIPIENT;

  if (USB_SETUP_GET (arg->type))
    return -1;

  if (rcp == DEVICE_RECIPIENT && arg->len == 0 && arg->value <= 127
      && arg->index == 0 && dev->configuration == 0)
    {
      gd32vf_set_daddr (arg->value);
      return usb_lld_ctrl_ack (dev);
    }

  return -1;
}

static int
std_get_descriptor (struct usb_dev *dev)
{
  struct device_req *arg = &dev->dev_req;
  if (USB_SETUP_SET (arg->type))
    return -1;

  return USB_EVENT_GET_DESCRIPTOR;
}

static int
std_get_configuration (struct usb_dev *dev)
{
  struct device_req *arg = &dev->dev_req;
  uint8_t rcp = arg->type & RECIPIENT;

