kadamski/chopstx/mcu/usb-gd32vf103.c
  if (USB_SETUP_SET (arg->type))
    return -1;

  if (arg->value != 0 || arg->index != 0 || arg->len != 1)
    return -1;

  if (rcp == DEVICE_RECIPIENT)
    return usb_lld_ctrl_send (dev, &dev->configuration, 1);

  return -1;
}

static int
std_set_configuration (struct usb_dev *dev)
{
  struct device_req *arg = &dev->dev_req;
  uint8_t rcp = arg->type & RECIPIENT;

  if (USB_SETUP_GET (arg->type))
    return -1;

  if (rcp == DEVICE_RECIPIENT && arg->index == 0 && arg->len == 0)
    return USB_EVENT_SET_CONFIGURATION;

  return -1;
}

static int
std_get_interface (struct usb_dev *dev)
{
  struct device_req *arg = &dev->dev_req;
  uint8_t rcp = arg->type & RECIPIENT;

  if (USB_SETUP_SET (arg->type))
    return -1;

  if (arg->value != 0 || (arg->index >> 8) != 0 || arg->len != 1)
    return -1;

  if (dev->configuration == 0)
    return -1;

  if (rcp == INTERFACE_RECIPIENT)
    return USB_EVENT_GET_INTERFACE;

  return -1;
}

static int
std_set_interface (struct usb_dev *dev)
{
  struct device_req *arg = &dev->dev_req;
  uint8_t rcp = arg->type & RECIPIENT;

  if (USB_SETUP_GET (arg->type) || rcp != INTERFACE_RECIPIENT
      || arg->len != 0 || (arg->index >> 8) != 0
      || (arg->value >> 8) != 0 || dev->configuration == 0)
    return -1;

  return USB_EVENT_SET_INTERFACE;
}

static int
handle_setup0 (struct usb_dev *dev)
{
  struct ctrl_data *data_p = &dev->ctrl_data;
  int r = -1;
  HANDLER handler;

  debug ("S");
  data_p->addr = NULL;
  data_p->len = 0;
  data_p->require_zlp = 0;

  if ((dev->dev_req.type & REQUEST_TYPE) == STANDARD_REQUEST)
    {
      switch (dev->dev_req.request)
	{
	case 0: handler = std_get_status;  break;
	case 1: handler = std_clear_feature;  break;
	case 3: handler = std_set_feature;  break;
	case 5: handler = std_set_address;  break;
	case 6: handler = std_get_descriptor;  break;
	case 8: handler = std_get_configuration;  break;
	case 9: handler = std_set_configuration;  break;
	case 10: handler = std_get_interface;  break;
	case 11: handler = std_set_interface;  break;
	default: handler = std_none;  break;
	}

      if ((r = (*handler) (dev)) < 0)
	{
	  usb_lld_ctrl_error (dev);
	  return USB_EVENT_OK;
	}
      else
	return r;
    }
  else
    return USB_EVENT_CTRL_REQUEST;
}

static int
handle_in0 (struct usb_dev *dev)
{
  int r = 0;

  if (dev->state == IN_DATA || dev->state == LAST_IN_DATA)
    handle_datastage_in (dev);
  else if (dev->state == WAIT_STATUS_IN)
    { /* Control WRITE transfer done successfully.  */
      if ((dev->dev_req.request == SET_ADDRESS) &&
	  ((dev->dev_req.type & (REQUEST_TYPE | RECIPIENT))
	   == (STANDARD_REQUEST | DEVICE_RECIPIENT)))
	r = USB_EVENT_DEVICE_ADDRESSED;
      else
	r = USB_EVENT_CTRL_WRITE_FINISH;
      dev->state = WAIT_SETUP;
      gd32vf_prepare_ep0_setup (dev);
    }
  else
    {
      dev->state = STALLED;
      gd32vf_ep_stall (ENDP0, USB_DIR_BOTH);
    }

  return r;
}

static void
handle_out0 (struct usb_dev *dev)
{
  if (dev->state == OUT_DATA)
    /* It's normal control WRITE transfer.  */
    handle_datastage_out (dev);
  else if (dev->state == WAIT_STATUS_OUT)
    { /* Control READ transfer done successfully.  */
      debug ("C R ack");
      dev->state = WAIT_SETUP;
      gd32vf_prepare_ep0_setup (dev);
    }
  else
    {
      debug (".");
      /*
       * dev->state == IN_DATA || dev->state == LAST_IN_DATA
       * (Host aborts the transfer before finish)
       * Or else, unexpected state.
       * STALL the endpoint, until we receive the next SETUP token.
       */
      dev->state = STALLED;
      gd32vf_ep_stall (ENDP0, USB_DIR_BOTH);
    }
}

void
usb_lld_reset (struct usb_dev *dev, uint8_t feature)
{
  usb_lld_set_configuration (dev, 0);
  dev->feature = feature;
  dev->state = WAIT_SETUP;

  USB_D->DCTL &= ~(1 << 0);     /* Clear wakeup.  */

  /* This TX FIFO flush is required.  With no Tx FIFO flush, writing
     about 300 times, it starts erroneous bytes on wire.  */
  gd32vf_tx_fifo_flush (0);

  gd32vf_set_daddr (0);
  gd32vf_prepare_ep0_setup_init ();
  gd32vf_prepare_ep0_setup (dev);
}

void
usb_lld_setup_endp (struct usb_dev *dev, int n, int ep_type,
		    int rx_en, int tx_en)
{
  (void)dev;
  if (rx_en)
    {
      if ((USB_O[n].DOEP_CTL & (1 << 15)) == 0)
	/* Select DATA0 and EP_TYPE.  */
	USB_O[n].DOEP_CTL |= ((1 << 28) | (ep_type << 18)
			      | (1 << 27) | (1 << 15) | 64);

      USB_D->DAEPINTEN |= (1 << (16 + n));
    }

  if (tx_en)
    {
      gd32vf_tx_fifo_flush (n);

      if ((USB_I[n].DIEP_CTL & (1 << 15)) == 0)
	{
	  /* Select DATA0, TX FIFO number, and EP_TYPE.	 */
	  /* Initially, no data to send, respond with NAK.
	     Activate the endpoint.  */
	  USB_I[n].DIEP_CTL = ((1 << 28) | (n << 22) | (ep_type << 18)
			       | (1 << 27) | (1 << 15) | 64);
	}

      USB_D->DAEPINTEN |= (1 << n);
    }
}


void
usb_lld_set_configuration (struct usb_dev *dev, uint8_t config)
{
  dev->configuration = config;
}

uint8_t
usb_lld_current_configuration (struct usb_dev *dev)
{
  return dev->configuration;
}

int
usb_lld_ctrl_recv (struct usb_dev *dev, void *p, size_t len)
{
  struct ctrl_data *data_p = &dev->ctrl_data;
  data_p->addr = (uint8_t *)p;
  data_p->len = len;
  dev->state = OUT_DATA;
  if (len > USB_MAX_PACKET_SIZE)
    len = USB_MAX_PACKET_SIZE;
  gd32vf_prepare_ep0_out (len);
  return USB_EVENT_OK;
}

/*
 * BUF: Pointer to data memory.
 *
 * BUFLEN: size of the data.
 */
int
usb_lld_ctrl_send (struct usb_dev *dev, const void *buf, size_t buflen)
{
  struct ctrl_data *data_p = &dev->ctrl_data;
  uint32_t len_asked = dev->dev_req.len;
  uint32_t len;

  debug ("<p %d:%d", buflen, len_asked);

  data_p->addr = (void *)buf;
  data_p->len = buflen;

  /* Restrict the data length to be the one host asks for */
  if (data_p->len >= len_asked)
    data_p->len = len_asked;
  /* ZLP is only required when host doesn't expect the end of packets.  */
  else if (data_p->len != 0 && (data_p->len % USB_MAX_PACKET_SIZE) == 0)
    data_p->require_zlp = 1;

  if (data_p->len <= USB_MAX_PACKET_SIZE)
    {
      len = data_p->len;
      dev->state = LAST_IN_DATA;
    }
  else
    {
      len = USB_MAX_PACKET_SIZE;
      dev->state = IN_DATA;
    }

  gd32vf_prepare_ep0_in (len);

  return USB_EVENT_OK;
}

void
usb_lld_rx_enable_buf (struct usb_dev *dev, int n, void *buf, size_t len)
{
  dev->epctl_rx[n-1].addr = (uint8_t *)buf;
  dev->epctl_rx[n-1].len = (uint16_t)len;

  debug ("\rrx %d (%d)", n, len);
  USB_O[n].DOEP_LEN = (1 << 19) | len; /* 1-packet, len-byte */
  USB_O[n].DOEP_CTL |= (1 << 31) | (1 << 26); /* Enable and Clear NAK */
}


void
usb_lld_tx_enable_buf (struct usb_dev *dev, int n, const void *buf, size_t len)
{
  dev->epctl_tx[n-1].addr = (uint8_t *)buf;
  dev->epctl_tx[n-1].len = (uint16_t)len;

  debug ("\rtx %d (%d)", n, len);
  USB_I[n].DIEP_LEN = (1 << 19) | len; /* 1-packet, len-byte */
  if (len)
    USB_D->DIEPFEINTEN |= (1 << n);
  USB_I[n].DIEP_CTL |= (1 << 31) | (1 << 26); /* Enable and Clear NAK */
}
